<template>
  <n-scrollbar>
    <div class="RightHomeCss">
      <div>
        <n-divider/>
        <n-h3 style="text-align: center">
          协议
        </n-h3>
        <n-tabs type="segment">
          <n-tab-pane name="chap1" tab="免责协议">
            <p>
              访问者在接受本网站服务之前，请务必仔细阅读本条款并同意本声明。访问者访问本网站的行为以及通过各类方式利用本网站的行为，都将被视作是对本声明全部内容的无异议的认可;如有异议，请立即跟本网站协商，并取得本网站的书面同意意见
            </p>
            <p>
              第一条访问者在从事与本网站相关的所有行为(包括但不限于访问浏览、利用、转载、宣传介绍)时，必须以善意且谨慎的态度行事;访问者不得故意或者过失的损害或者弱化本网站的各类合法权利与利益，不得利用本网站以任何方式直接或者间接的从事违反中国法律、国际公约以及社会公德的行为，且访问者应当恪守下述承诺:
            </p>
            <p>1、传输和利用信息符合中国法律、国际公约的规定、符合公序良俗;<br/></p>
            <p>2、不将本网站以及与之相关的网络服务用作非法用途以及非正当用途;<br/></p>
            <p>3、不干扰和扰乱本网站以及与之相关的网络服务;<br/></p>
            <p>4、遵守与本网站以及与之相关的网络服务的协议、规定、程序和惯例等。<br/></p>
            <p>第二条除我们另有明确说明或者中国法律有强制性规定外，本网站用户原创的作品，本网站及作者共同享有版权，其他网站及传统媒体如需使用，须取得本网站的书面授权，未经授权严禁转载或用于其它商业用途。<br/>
            </p>
            <p>第三条未经常本网站和作者共同同意，其他任何机构不得以任何形式侵犯其作品著作权，包括但不限于：擅自复制、链接、非法使用或转载，或以任何方式建立作品镜像。<br/>
            </p>
            <p>
              第四条本网站有部分内容来自互联网，如无意中侵犯了哪个媒体、公司、企业或个人等的知识产权，请来电或致函告之，本网站将在规定时间内给予删除等相关处理，若有涉及版权费等问题，请及时提供相关证明等材料并与我们联系，通过友好协商公平公正原则处理纠纷。<br/>
            </p>
            <p>第五条以上声明内容的最终解释权归网站所有。<br/></p>
          </n-tab-pane>
          <n-tab-pane name="chap2" tab="问题总和">
            <p>1、歌单界面标题切换，分页点击后无法回到初始分页1</p>
            <p>2、界面搭配美观问题</p>
            <p>3、扫码登录取消，请求继续</p>
            <p>4、页面加载，渲染部分报错</p>
            <p>5、拖动进度条，有概率中断播放</p>
          </n-tab-pane>
          <n-tab-pane name="chap3" tab="数据来源说明">
            <p>一、本项目所使用数据来自github Node项目</p>
            <p>二、本项目不存在任何存储数据行为</p>
            <p>三、本项目属于个人毕业项目，数据不会用于商业行为</p>
          </n-tab-pane>
          <n-tab-pane name="chap4" tab="即将更新">
            <p>1、页面整体动画效果</p>
            <p>2、代码结构样式调整</p>
          </n-tab-pane>
          <n-tab-pane name="chap5" tab="更新列表">
            <p>1、首页数据展示与右侧功能 - 2023-1-11</p>
            <p>2、歌曲播放与歌词滚动 2023-1-12</p>
            <p>3、播放背景随机 2023-1-12</p>
            <p>4、播放界面歌词与列表动画</p>
            <p>5、登录界面与验证码</p>
            <p>6、歌手界面与歌手详情更新</p>
            <p>7、播放界面更新 2023-1-14</p>
            <p>8、界面基本构建完毕 2023-2-2</p>
            <p>9、播放器功能完善 2023-2-21</p>
          </n-tab-pane>
        </n-tabs>
      </div>
    </div>
  </n-scrollbar>

</template>

<script lang="ts" setup>


</script>

<style scoped>
p {
  text-indent: 20px;
  margin: 8px 0;
}
</style>